while True:
    user_input = input('Введіть звернення: ').lower()  # Зчитуємо звернення користувача та переводим його в нижній регістр.

    # Перевіряємо, чи містить звернення одне з вітань.
    if 'привіт' in user_input or 'хай' in user_input or 'доброго дня' in user_input:
        print('Доброго вечора, я бот з України!')  # Якщо містить, виводимо вітання.

    # Перевіряємо, чи містить звернення запитання про стан користувача.
    elif 'як справи?' in user_input or 'що робиш?' in user_input or 'чим займаєшся?' in user_input:
        print('Вчусь програмувати на Python!')  # Якщо містить, виводимо відповідь.

    # Перевіряємо, чи містить звернення інформацію про кінематограф)).
    elif 'фільм' in user_input or 'кінотеатр' in user_input or 'серіал' in user_input:
        print('Соррі що втручуюсь, не знаю про що йдеться мова, але подивіться серіал "Білий лотос", він просто бомба!')   # Якщо містить, рекомендуємо подивитись серіал.

    # Перевіряємо, чи містить прощання.
    elif 'бувай' in user_input or 'надобраніч' in user_input or 'гудбай' in user_input or 'до зустрічі' in user_input:
        print("Побачимось у мережі, I'll be back.")  # Якщо містить, прощаємось та виходимо з циклу.
        break

    # Якщо жодна з умов не виконана, вважаємо, що користувач написав щось незрозуміле.
    else:
        print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')
