# створюємо змінну та присвоюємо їй значення рівне 0
sum_numbers = 0
# починаємо нескінченний цикл
while True:
    # зчитуємо ввід користувача
    user_input = input('Ваше число: ')
    # переводимо ввід в нижній регістр і якщо користувач ввів sum, завершуємо цикл
    if user_input.lower() == 'sum':
        break
    # спробуємо перетворити ввід на дійсне число
    try:
        number = float(user_input)
    # якщо виникає помилка, виводимо повідомлення про помилку
    except ValueError:
        print('Введіть число або sum будь ласка!')
    # якщо перетворення відбулося успішно, додаємо число до суми
    else:
        sum_numbers += number
# виводимо суму чисел введених користувачем і перетворюємо на ціле число
print('Сума ваших чисел:', int(sum_numbers))
