# створюємо список для зберігання введених чисел
numbers = []
# починаємо нескінченний цикл
while True:
    # спробуємо зчитати ввід
    try:
        user_input = input('Ваше число: ')
        # переводимо введення в нижній регістр і якщо користувач ввів sum, завершуємо цикл
        if user_input.lower() == 'sum':
            break
        number = float(user_input)  # перетворюємо ввід в дійсне число
        numbers.append(number)  # додаємо введення до списку
     # якщо виникає помилка, виводимо повідомлення про помилку
    except ValueError:
        print('Введіть число або sum будь ласка!')
# підраховуємо суму введених чисел за допомогою sum
sum_numbers = sum(numbers)
# виводимо суму і перетворюємо на ціле число
print('Сума ваших чисел:', int(sum_numbers))
